"Nightly" = "לילי";
"Stable" = "יציב";
"Unstable" = "לא יציב";

"File Drawer" = "לוח מקובץ";
"Hot Keys" = "מקשים חםים";

"Output" = "פלט";
"Remote" = "שלט רחוק";
"Updates" = "עדכונים";

"Press Key..." = "...ללחוץ מקש";
